Revit 2024 API
MasonryCMUType Enumeration
 The enumerated type representing the permitted values for the asset property "MasonryCMUType" from the "MasonryCMU" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum MasonryCMUType
Visual Basic
Public Enumeration MasonryCMUType
Visual C++
public enum class MasonryCMUType
Members
Member name | Description
Cmu
Masonry
See Also
Autodesk.Revit.DB.Visual Namespace